Revit 2027 API
ParameterTypeId.ProjectionType Property
 "Projection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectionType { get; }
Public Shared ReadOnly Property ProjectionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectionType {
	ForgeTypeId^ get ();
}
static member ProjectionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace